Revit 2026 API

# PlanViewDirection Enumeration

---

This enumerated type represents the possible directions for a plan view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PlanViewDirection
```
```vb
Public Enumeration PlanViewDirection
```
```cpp
public enum class PlanViewDirection
```
```fsharp
type PlanViewDirection
```

| Member name | Value | Description |
| --- | --- | --- |
| Down | 0 | Revit looks down onto the plan view |
| Undefined | -1 | View does not use Plan View Direction |
| Up | 1 | Revit looks up to the plan view |

#### Reference

Autodesk.Revit.DB Namespace